# SQL Essentials

- `SQL` stands for Structured Query Language.
- `SQL` is a standard language for storing, manipulating and retrieving data in databases.
- `SQL` is **NOT** case sensitive. `SELECT` is the same as `select`.

What can `SQL` do?
- Execute queries against a database
- Retrieve data from a database
- Insert records in a database
- Update records in a database
- Delete records from a database
- Create new databases
- Create new tables in a database
- Create stored procedures in a database
- Create views in a database
- Set permissions on tables, procedures, and views

# Requirements
We will be using **Northwind** database to practice our SQL skills through SQLite. The Northwind database consists of 12 tables with a lot of **fields** (column) and hundreds of **records** (rows) that we can use for query.

In [ ]:
!pip install pandas
!pip install sqlalchemy  # ORM for database
!pip install ipython-sql # SQL magic function

ipython-sql introduces a `%sql`(for single-line command) and `%%sql`(for multiple-line commands) magic to our Jupyter notebook allowing us to connect to a database, using SQLAlchemy connect strings, then issue SQL commands within iPython or iPython Notebook.

## SQL Extension

In [1]:
%load_ext sql

## Connect to Database

In [2]:
%sql sqlite:///northwind.db

A database most often contains one or more tables. Each table is identified by a name (e.g. "Customers" or "Orders"). Tables contain **records** (rows) with data.

The following will print out the column information for a specific table inside the database.

In [3]:
%sql PRAGMA table_info(Customers);

 * sqlite:///northwind.db
Done.

[(0, 'CustomerID', 'nchar(5)', 1, None, 1),
 (1, 'CompanyName', 'nvarchar(40)', 1, None, 0),
 (2, 'ContactName', 'nvarchar(30)', 0, None, 0),
 (3, 'ContactTitle', 'nvarchar(30)', 0, None, 0),
 (4, 'Address', 'nvarchar(60)', 0, None, 0),
 (5, 'City', 'nvarchar(15)', 0, None, 0),
 (6, 'Region', 'nvarchar(15)', 0, None, 0),
 (7, 'PostalCode', 'nvarchar(10)', 0, None, 0),
 (8, 'Country', 'nvarchar(15)', 0, None, 0),
 (9, 'Phone', 'nvarchar(24)', 0, None, 0),
 (10, 'Fax', 'nvarchar(24)', 0, None, 0)]

### SQL General Data Types
<br>

| Data Type | Description |
| :-: | :- | 
| CHAR(*n*)  | 	Character string. Fixed-length *n*.|
| VARCHAR(*n*) | Character string. Variable length. Maximum length *n*. |
| INT  | Integer numerical (no decimal). Precision 10.|
| SMALLINT  | Integer numerical (no decimal). Precision 5. |
| BIGINT   |  Integer numerical (no decimal). Precision 19. |
| DECIMAL(*p,s*) | Exact numerical, precision *p*, scale *s*. |
| FLOAT | Approximate numerical. Precision 16.|
|REAL |	Approximate numerical. Precision 7.|
|TEXT	| Holds a string with a maximum length of 65,535 characters.|
| DATETIME	| A date and time combination. Format: YYYY-MM-DD HH:MI:SS|
| IMAGE	| Variable width binary string that holds 2GB data.|
| BIT	| Integer that can be 0, 1, or NULL.|
| MONEY	| Monetary data from -922,337,203,685,477.5808 to 922,337,203,685,477.5807.|

# SQL Syntax

Most of the actions we need to perform on a database are done with SQL statements. In this note, we will be using `MySQL` database system.

## SELECT Clause
- Used to select data from a database.
- Data returned stored in a result table, called the **result-set**.

### SELECT Syntax
```sql
SELECT column_name(s)
FROM table_name;
```
For `column_name(s)`, use `SELECT *` to print out all columns.

Use `LIMIT` to specify how many rows to be printed.
```sql
SELECT column_name(s)
FROM table_name
LIMIT number;
```

### Example
Get 5 customers from `Customers` table.

In [17]:
%%sql
SELECT * FROM Customers
LIMIT 5;

 * sqlite:///northwind.db
Done.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Inigo Montoya', 'Owner', 'Mataderos  2312', 'México D.F.', None, '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', None, 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750'),
 ('BERGS', 'Berglunds snabbköp', 'Christina Berglund', 'Order Administrator', 'Berguvsvägen  8', 'Luleå', None, 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67')]

To select only unique values (no duplicate), use `DISTINCT`.
```sql
SELECT DISTINCT column_name(s)
FROM table_name;
```

### Example
Get all **unique** `Country` from `Customers` table.

In [18]:
%%sql
SELECT DISTINCT Country FROM Customers;

 * sqlite:///northwind.db
Done.

[('Germany',),
 ('Mexico',),
 ('UK',),
 ('Sweden',),
 ('France',),
 ('Spain',),
 ('Canada',),
 ('Argentina',),
 ('Switzerland',),
 ('Brazil',),
 ('Austria',),
 ('Italy',),
 ('Portugal',),
 ('USA',),
 ('Venezuela',),
 ('Ireland',),
 ('Belgium',),
 ('Norway',),
 ('Denmark',),
 ('Finland',),
 ('Poland',)]

`COUNT()` returns the number of rows from the selected column.
```sql
SELECT COUNT(DISTINCT column_name)
FROM table_name;
```
or use this to print the result as an assigned column name.
```sql
SELECT COUNT(*) AS DistinctColumn
FROM (SELECT DISTINCT column_name FROM table_name);
```

### Example
Get total number of `Country` from `Customers` table.

In [39]:
%%sql
SELECT COUNT(Country) AS Total
FROM Customers;

 * sqlite:///northwind.db
Done.

[(94,)]

### Example
Get total number of **unique** `Country` from `Customers` table.

In [40]:
%%sql
SELECT COUNT(DISTINCT Country) AS Total
FROM Customers;

 * sqlite:///northwind.db
Done.

[(21,)]

## WHERE clause
- Used to filter records.
- Also used to extract only those records that fulfill a specified condition.

### WHERE Syntax
```sql
SELECT column_name(s)
FROM table_name
WHERE condition;
```
Use `WHERE NOT` to select records where the condition is False.
```sql
SELECT column_name(s)
FROM table_name
WHERE NOT condition;
```

#### Operators in WHERE Clause
<br>

| Operator | Description | 
| :-: | --- |
| =	| Equal	| 
| >	| Greater than	| 
| <	| Less than	| 
| >= | Greater than or equal | 
| <= | Less than or equal | 
| <> | Not equal*  | 
| [BETWEEN](#BETWEEN-Operator) | Between a certain range	| 
| [LIKE](#LIKE-Operator) | Search for a pattern | 
| [IN](#IN-Operator) | To specify multiple possible values for a column | 

*Note: In some versions of SQL this operator may be written as !=

### Example
Get all orders from `Orders` table with `OrderID` 10500.

In [29]:
%%sql
SELECT * FROM Orders
WHERE OrderID = 10500;

 * sqlite:///northwind.db
Done.

[(10500, 'LAMAI', 6, '1997-04-09 00:00:00', '1997-05-07 00:00:00', '1997-04-17 00:00:00', 42.68, "La maison d'Asie", '1 rue Alsace-Lorraine', 'Toulouse', None, '31000', 'France')]

### Example
Get all customers from `Customers` table that live in Mexico.

In [21]:
# Use quotation marks for string-type elements
%%sql
SELECT * FROM Customers
WHERE Country = 'Mexico';

 * sqlite:///northwind.db
Done.

[('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Inigo Montoya', 'Owner', 'Mataderos  2312', 'México D.F.', None, '05023', 'Mexico', '(5) 555-3932', None),
 ('CENTC', 'Centro comercial Moctezuma', 'Antonio Banderas', 'Marketing Manager', 'Sierras de Granada 9993', 'México D.F.', None, '05022', 'Mexico', '(5) 555-3392', '(5) 555-7293'),
 ('PERIC', 'Pericles Comidas clásicas', 'Salma Hayek', 'Sales Representative', 'Calle Dr. Jorge Cash 321', 'México D.F.', None, '05033', 'Mexico', '(5) 552-3745', '(5) 545-3745'),
 ('TORTU', 'Tortuga Restaurante', 'Hugo Sanchis', 'Owner', 'Avda. Azteca 123', 'México D.F.', None, '05033', 'Mexico', '(5) 555-2933', None)]

## BETWEEN Operator
- Selects values within a given range. The values can be numbers, text, or dates.
- Inclusive: begin and end values are included.

### BETWEEN Syntax
```sql
SELECT column_name(s)
FROM table_name
WHERE column_name BETWEEN value1 AND value2;
```
Use `NOT BETWEEN` to query records outside the specified range.
```sql
SELECT column_name(s)
FROM table_name
WHERE column_name NOT BETWEEN value1 AND value2;
```

### Example
Get all products that their `UnitPrice` are `BETWEEN` 1 and 7.

In [33]:
%%sql
SELECT * FROM Products
WHERE UnitPrice BETWEEN 1 AND 7;

 * sqlite:///northwind.db
Done.

[(13, 'Konbu', 6, 8, '2 kg box', 6, 24, 0, 5, 0, None),
 (24, 'Guaraná Fantástica', 10, 1, '12 - 355 ml cans', 4.5, 20, 0, 0, 1, '1996-07-04 00:00:00'),
 (33, 'Geitost', 15, 4, '500 g', 2.5, 112, 0, 20, 0, None),
 (52, 'Filo Mix', 24, 5, '16 - 2 kg boxes', 7, 38, 0, 25, 0, None)]

### Example
Get all products that their `UnitPrice` are `NOT BETWEEN` 5 and 15, and their `CategoryID` are not 1, 2, 3, 4 and 5.

In [6]:
%%sql
SELECT * FROM Products
WHERE (UnitPrice NOT BETWEEN 1 AND 5) AND (CategoryID NOT BETWEEN 1 AND 5)

 * sqlite:///northwind.db
Done.

[(7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30, 15, 0, 10, 0, None),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97, 29, 0, 0, 1, '1996-07-04 00:00:00'),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31, 31, 0, 0, 0, None),
 (13, 'Konbu', 6, 8, '2 kg box', 6, 24, 0, 5, 0, None),
 (14, 'Tofu', 6, 7, '40 - 100 g pkgs.', 23.25, 35, 0, 0, 0, None),
 (17, 'Alice Mutton', 7, 6, '20 - 1 kg tins', 39, 0, 0, 0, 1, '1996-07-04 00:00:00'),
 (18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62.5, 42, 0, 0, 0, None),
 (28, 'Rössle Sauerkraut', 12, 7, '25 - 825 g cans', 45.6, 26, 0, 0, 1, '1996-07-04 00:00:00'),
 (29, 'Thüringer Rostbratwurst', 12, 6, '50 bags x 30 sausgs.', 123.79, 0, 0, 0, 1, '1996-07-04 00:00:00'),
 (30, 'Nord-Ost Matjeshering', 13, 8, '10 - 200 g glasses', 25.89, 10, 0, 15, 0, None),
 (36, 'Inlagd Sill', 17, 8, '24 - 250 g  jars', 19, 112, 0, 20, 0, None),
 (37, 'Gravad lax', 17, 8, '12 - 500 g pkgs.', 26, 11, 50, 25, 0, None),
 (40, 'Boston Crab Meat', 19, 8, '24 - 4 oz tins', 18.4, 123, 0, 30, 0, None),
 (41, "Jack's New England Clam Chowder", 19, 8, '12 - 12 oz cans', 9.65, 85, 0, 10, 0, None),
 (45, 'Rogede sild', 21, 8, '1k pkg.', 9.5, 5, 70, 15, 0, None),
 (46, 'Spegesild', 21, 8, '4 - 450 g glasses', 12, 95, 0, 0, 0, None),
 (51, 'Manjimup Dried Apples', 24, 7, '50 - 300 g pkgs.', 53, 20, 0, 10, 0, None),
 (53, 'Perth Pasties', 24, 6, '48 pieces', 32.8, 0, 0, 0, 1, '1996-07-04 00:00:00'),
 (54, 'Tourtière', 25, 6, '16 pies', 7.45, 21, 0, 10, 0, None),
 (55, 'Pâté chinois', 25, 6, '24 boxes x 2 pies', 24, 115, 0, 20, 0, None),
 (58, 'Escargots de Bourgogne', 27, 8, '24 pieces', 13.25, 62, 0, 20, 0, None),
 (73, 'Röd Kaviar', 17, 8, '24 - 150 g jars', 15, 101, 0, 5, 0, None),
 (74, 'Longlife Tofu', 4, 7, '5 kg pkg.', 10, 4, 20, 5, 0, None)]

## LIKE Operator
- Used in a `WHERE` clause to search for a specified pattern in a column.
- There are two wildcards often used in conjunction with the `LIKE` operator: <br>
`%` represents zero, one, or multiple characters, `_` represents a single character
- The percent sign and the underscore can also be used in combinations.

<div class = "alert alert-block alert-info">
    <p>
        <b> Note: </b>
        MS Access uses an asterisk (*) instead of the percent sign (%), and a question mark (?) instead of the underscore (_)
    <p>
</div>

### LIKE Syntax
```sql
SELECT column_name(s)
FROM table_name
WHERE columnN LIKE pattern;
```

| Commands | Description |
| :-: | :-- |
| `'a%'`| Starts with 'a'| 
| `'%a'`| Ends with 'a'| 
| `'%a%'`| Have 'a' in any position| 
| `'_a%'`| Have 'a' in second position| 
| `'a_%'`| Starts with 'a' and at least 2 characters| 
| `'a__%'`| Starts with 'a' and at least 3 characters| 
| `'a%b'`| Starts with 'a' and ends with 'b'|

### Example
Find records in `Customers` table where `CompanyName` starts with letter `A`.

In [19]:
%%sql
SELECT *
FROM Customers
WHERE CompanyName LIKE "a%"

 * sqlite:///northwind.db
Done.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Inigo Montoya', 'Owner', 'Mataderos  2312', 'México D.F.', None, '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', None, 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750')]

### Example
Find records in `Customers` table where `CustomerName` starts with letter `A` and ends with letter `O`.

In [25]:
%%sql
SELECT *
FROM Customers
WHERE ContactName LIKE 'a%o'

 * sqlite:///northwind.db
Done.

[('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ROMEY', 'Romero y tomillo', 'Alejandra Camino', 'Accounting Manager', 'Gran Vía, 1', 'Madrid', None, '28001', 'Spain', '(91) 745 6200', '(91) 745 6210')]

### Wildcard Characters
- Used to substitute one or more characters in a string.

#### Wildcard Characters in MS Access

| Symbol	| Description	| Example |
| :-: | :-- | :-- |
|`*`|	Represents zero or more characters	|`bl*` finds bl, black, blue, and blob|
|`?`|	Represents a single character	|`h?t` finds hot, hat, and hit|
|`[]`|	Represents any single character within the brackets	|`h[oa]t` finds hot and hat, but not hit|
|`!`|	Represents any character not in the brackets	|`h[!oa]t` finds hit, but not hot and hat|
|`-`|	Represents a range of characters	|`c[a-b]t` finds cat and cbt|
|`#`|	Represents any single numeric character	|`2#5` finds 205, 215, 225, 235, 245, 255, 265, 275, 285, and 295|

#### Wildcard Characters in SQL Server

|Symbol	|Description	|Example|
|:-:|:--|:--|
|`%`|	Represents zero or more characters	|`bl%` finds bl, black, blue, and blob|
|`_`|	Represents a single character	|`h_t` finds hot, hat, and hit|
|`[]`|	Represents any single character within the brackets	|`h[oa]t` finds hot and hat, but not hit|
|`^`|	Represents any character not in the brackets	|`h[^oa]t` finds hit, but not hot and hat|
|`-`|	Represents a range of characters	|`c[a-b]t` finds cat and cbt|